pfo3 diagram
